"""**************************************************************************
*
*  File name: 2018_4_11_chapter12_learn.py
*  Date: 2018/4/11 15:07
*  Copyright (c) 2013-2018 by Qulusheng.
*  Author: Lucian_qls
*  E-mail: 1017557706@qq.com
*
*  Function:
*   .外星人入侵游戏：
    1、用于管理图形、动画乃至声音，使用pygame来处理在屏幕上绘制图像等任务。
    2、安装Pygame，创建一艘根据用户输入而左右移动和射击的飞船。
    3、学习管理包含多个文件的项目，重构代码，管理文件内容
    4、游戏包含的文件放在alien_invasion
 * ChangeLog:
 * V1.0
**************************************************************************"""
